app/controllers/comments_controller.rb

def create
@post = Post.find(params[:post_id])
@comment = @post.comments.create!(params[:comment])
---
SELECT * FROM "posts" WHERE ("posts"."id" = 2)
INSERT INTO "comments" ("created_at", "body", "updated_at", "post_id") VALUES('2009-06-22 17:07:33', 'test', '2009-06-22 17:07:33', NULL)