app/controllers/posts_controller.rb

SELECT * FROM "posts" ORDER BY id DESC
---
  def index
    @posts = Post.all(:order => "id DESC")

SELECT * FROM "posts"
---
    def index2
    @posts = Post.all

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2009-06-22 15:51:31', 'rails boom', 'woot', '2009-06-22 15:51:31')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2009-06-22 15:58:17', "title" = 'ro' WHERE "id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])